Revit 2024 API
LightType.GetInitialIntensity Method
 Return a copy of an object derived from InitialIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialIntensity GetInitialIntensity()
Visual Basic
Public Function GetInitialIntensity As InitialIntensity
Visual C++
public:
InitialIntensity^ GetInitialIntensity()
See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace